//
//  QuotationModel.swift
//  Now
//
//  Created by 中重歩夢 on 2019/03/08.
//  Copyright © 2019 Ayumu Nakashige. All rights reserved.
//

import Foundation

class QuotationModel {
    //ランダムに数字生成
    //生成された数字で配列にアクセス
    var greatManArray: [String] = [
        "福沢諭吉","マイケル・ジョーダン", "シェイクスピア", "王貞治", "渋沢栄一","エイブラハム・リンカーン","アインシュタイン", "スティーブ・ジョブズ","ガンジー","ジョン・ラボック",
        "シェイクスピア","ウォルト・ディズニー","美輪明宏", "エラ・ウィーラー・ウィルコックス","トーマス・エジソン","ガンジー","シェイクスピア","カール・ハッベル","スティーブ・ジョブズ","斎藤茂太","シェイクスピア","アインシュタイン","ベンジャミン・フランクリン","ゲーテ", "ユードラ・ウェルティ","スティーブ・ジョブズ","斎藤茂太","アイザック･ニュートン","村上春樹","長嶋茂雄","レオナルド・ダ・ヴィンチ","ジョージ・ワシントン","王貞治","湯川秀樹","魯迅","ヘンリー・フォード","アリストテレス","スティーブ・ジョブズ","スティーブ・ジョブズ","松下幸之助","孫正義","ウォルター･バジョット","イチロー","トーマス・エジソン","モハメドアリ","バリー・ボンズ","井上靖","ソフォクレス","大越俊夫","カーネル・サンダース","ヘレン・ケラー","ボビー・ナイト","アインシュタイン","イアン・ソープ","イーロン・マスク","ビル・ゲイツ","ゲーテ","セオドア・ルーズベルト","トッド・スキナー"]
    var quotationArray:[String] = [
        "進まざる者は必ず退き、退かざる者は必ず進む。","目標を達成するには、全力で取り組む以外に方法はない。そこに近道はない。", "険しい丘に登るためには、最初にゆっくり歩くことが必要である。","努力は必ず報われる。もし報われない努力があるのならば、それはまだ努力と呼べない。", "もうこれで満足だという時は、すなわち衰える時である。","待っているだけの人達にも何かが起こるかもしれないが、それは努力した人達の残り物だけである。","天才とは努力する凡才のことである。","偉大な大工は、誰も見ないからといって、床裏にひどい木材を使ったりはしない。","明日死ぬかのように生きよ。永遠に生きるかのように学べ。","他人と比較して、他人が自分より優れていたとしても、それは恥ではない。しかし、去年の自分より今年の自分が優れていないのは立派な恥だ。","天は自ら行動しない者に救いの手をさしのべない。","何かを始めるためには、しゃべるのをやめて行動し始めなければならない","人間いくつになっても新たな道へ踏み出す時が来る。それまでの苦労や人生体験はその時ための基本教育。","この世には二種類の人間がいる。努力する人と人の努力にたよる人。","ほとんどすべての人間は、もうこれ以上アイデアを考えるのは不可能だというところまで行きつき、そこでやる気をなくしてしまう。勝負はそこからだというのに。","多くの犠牲と苦労を経験しなければ、成功とは何かを決して知ることはできない。", "たとえ小さな斧でも、数百度これを打てば堅い樫の木も切り倒せる。","過去の成果で未来を生きることはできない。人は一生何かを生み出し続けなければならない。","点が将来結びつくと信じなくてはいけない。信じるものを持たなければいけないのだ。","焦らない。でも、あきらめない。","とじこめられている火が、いちばん強く燃えるものだ。","何かを学ぶためには、自分で体験する以上にいい方法はない。","もし財布の中身を頭につぎこんだら、誰も盗むことはできない。知識への投資がいつの世でも最高の利子を生む","生きている間は、なにごとも延期するな。なんじの一生は、実行また実行であれ。", "どんなに時間がかかっても、そんなの問題じゃない。大切なのは目標をもつこと。","前進し続けられたのは、自分がやることを愛していたからだ。","あきらめないことだ。一度あきらめると習慣になる。","今日なし得ることに全力をつくせ。しからば明日は一段の進歩あらん。","希望があるところには必ず試練があるものだから。","挫折してもプライドは失わない、それは努力しているからだ。","人間はやり通す力があるかないかによってのみ、称賛または非難に値する。","常に継続してやっていれば、素晴らしいことが出来るようになる。","勝つための最善の努力は、どんな時もやめてはいけない。逃げたらだめなのです。","一日生きることは、一歩進むことでありたい。","天才なんかあるものか。僕は他人がコーヒーを飲んでいる時間に仕事をしただけだ。","努力が効果をあらわすまでには時間がかかる。多くの人はそれまでに飽き、迷い、挫折する。","人間は、目標を追い求める動物である。目標へ到達しようと努力することによってのみ、人生が意味あるものとなる。","一つのことを、一生やり続けられると確信する日がくる。","旅の過程にこそ価値がある","人は何度やりそこなっても、「もういっぺん」の勇気を失わなければ必ずものになる。","難題に遭遇しない人は、自分の可能性に挑戦していないのかもしれない。","人生における大きな喜びは、「君にはできない」と世間が言うことをやってのけることである。","やってみて「ダメだ」とわかったことと、はじめから「ダメだ」と言われたことは、違います","失敗？これはうまくいかないということを確認した成功だよ。","自分をダメだと思えば、その時点から自分はダメになる","僕は、努力をしない自分は嫌いだ。","努力する人は希望を語り、怠ける人は不満を語る。","ごまかして成功するよりも、堂々と失敗するほうがよい","人を妬むのは、自分が完全燃焼していないからだ。","人間は働きすぎてダメになるより、休みすぎてサビつく方がずっと多い。"
            ,"人生はどちらかです。勇気をもって挑むか、棒にふるか。","「勝つ意欲」は大して重要ではない。そんなものは誰でも持っているからだ。重要なのは「勝つために準備する意欲」である。"
,"私は天才ではありません。ただ人より長く「ひとつのこと」と付き合ってきただけです。","成功とは、自分の達成度のことだ。他人を気にする必要はまったくない","失敗は1つの選択です。もし、失敗していなければ、あなたは十分に革新的になれないでしょうから。","人類史上の進歩のほとんどは、不可能を受け入れなかった人々によって達成された。","自分一人で石を持ち上げる気がなかったら、二人でも持ち上がらない。","ミスをしない人間は、何もしない人間だけだ。","一歩を踏み出せるなら、もう一歩も踏み出せる"
    ]
    
    
    
    
    
    
//    var quotationDic: [String: String] = [
//
//        "福沢諭吉": "進まざる者は必ず退き、退かざる者は必ず進む。",
//        "マイケル・ジョーダン": "目標を達成するには、全力で取り組む以外に方法はない。そこに近道はない。",
//        "シェイクスピア": "険しい丘に登るためには、最初にゆっくり歩くことが必要である。",
//        "王貞治": "努力は必ず報われる。もし報われない努力があるのならば、それはまだ努力と呼べない。",
//        "渋沢栄一": "もうこれで満足だという時は、すなわち衰える時である。",
//        "エイブラハム・リンカーン": "待っているだけの人達にも何かが起こるかもしれないが、それは努力した人達の残り物だけである。",
//        "アインシュタイン": "天才とは努力する凡才のことである。",
//        "スティーブ・ジョブズ": "偉大な大工は、誰も見ないからといって、床裏にひどい木材を使ったりはしない。",
//        "ガンジー": "明日死ぬかのように生きよ。永遠に生きるかのように学べ。",
//        "ジョン・ラボック": "他人と比較して、他人が自分より優れていたとしても、それは恥ではない。しかし、去年の自分より今年の自分が優れていないのは立派な恥だ。",
//        "シェイクスピア": "天は自ら行動しない者に救いの手をさしのべない。",
//        "ウォルト・ディズニー": "何かを始めるためには、しゃべるのをやめて行動し始めなければならない",
//        "美輪明宏": "人間いくつになっても新たな道へ踏み出す時が来る。それまでの苦労や人生体験はその時ための基本教育。",
//        "エラ・ウィーラー・ウィルコックス": "この世には二種類の人間がいる。努力する人と人の努力にたよる人。",
//        "トーマス・エジソン": "ほとんどすべての人間は、もうこれ以上アイデアを考えるのは不可能だというところまで行きつき、そこでやる気をなくしてしまう。勝負はそこからだというのに。",
//        "本田圭佑": "ライバルに差をつけたいのなら、環境を変えてほしい。なんだかんだ言っても一度ぬるま湯に浸かってしまうと、なかなか抜け出せない。だから、「何か物足りない」と思ったら、自分のことを知らない環境に飛び込んで行ってほしいと思う。",
//        "ガンジー": "多くの犠牲と苦労を経験しなければ、成功とは何かを決して知ることはできない。",
//        "シェイクスピア": "たとえ小さな斧でも、数百度これを打てば堅い樫の木も切り倒せる。",
//        "カール・ハッベル": "過去の成果で未来を生きることはできない。人は一生何かを生み出し続けなければならない。",
//        "スティーブ・ジョブズ": "点が将来結びつくと信じなくてはいけない。信じるものを持たなければいけないのだ。",
//        "斎藤茂太": "焦らない。でも、あきらめない。",
//        "シェイクスピア": "とじこめられている火が、いちばん強く燃えるものだ。",
//        "アインシュタイン": "何かを学ぶためには、自分で体験する以上にいい方法はない。",
//        "ベンジャミン・フランクリン": "もし財布の中身を頭につぎこんだら、誰も盗むことはできない。知識への投資がいつの世でも最高の利子を生む",
//        "ゲーテ": "生きている間は、なにごとも延期するな。なんじの一生は、実行また実行であれ。",
//        "ユードラ・ウェルティ": "どんなに時間がかかっても、そんなの問題じゃない。大切なのは目標をもつこと。",
//        "スティーブ・ジョブズ": "前進し続けられたのは、自分がやることを愛していたからだ。"
//
//
//    ]
    
    
}
